# ExportIFCCategoryKey Properties

---
The ExportIFCCategoryKey type exposes the following members.
| Name| Description
---|---|---
| CategoryName|  The Revit category name.
| CustomSubCategoryId|  The Revit custom subcategory id.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| SubCategoryName|  The Revit subcategrory name.
Top
#### Reference
ExportIFCCategoryKey Class
Autodesk.Revit.DB Namespace